app/Http/Controllers/PostController.php

    public function index()
    {
        $posts = Post::all();
---
select * from `posts`

    public function create()
    {
        $users = User::all();
---
select * from `users`